switched to d2 for diagram, removed chrome dependency by using a js vm (goja), decomposed large files to more understandable forms
